<a href="https://colab.research.google.com/github/ITBA-Python/Certificacion-Profesional-Python/blob/main/Clase_4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [30]:
%load_ext autoreload
%autoreload 2
import sys
sys.path.append('../') 
import Helper as faux
import pandas as pd
from datetime import datetime
from clases.Scores import Score

#df_personas, df_trabajadores, df_usuarios, df_peliculas, df_scores=Faux.load_all()

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [69]:
df_sco = Score.create_df_from_csv('../data/scores.csv')
df_sco.head()

   user_id  movie_id  rating                Date
0      196       242       3 1997-12-04 15:55:49
1      186       302       3 1998-04-04 19:22:22
2       22       377       1 1997-11-07 07:18:36
3      244        51       2 1997-11-27 05:02:03
4      166       346       1 1998-02-02 05:33:16

In [32]:
#Doy de Alta satisfactoriamente con el metodo write_df en Scores
NuevoScore = Score(idPelicula=22200,idUsuario=250,puntuacion=9,timestamp=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
df_scoresAgregado = NuevoScore.write_df(df_sco)
print(f'Rows del df original: {df_sco.shape[0]}\nRows del df Agregado: {df_scoresAgregado.shape[0]}\n')

Rows del df original: 100000
Rows del df Agregado: 100001

In [33]:

#Doy de Alta un registro ya existente y lo actualizó con el metodo write_df en Scores
ScoreExistente = Score(idPelicula=200,idUsuario=250,puntuacion=8,timestamp=datetime.now().strftime("%d/%m/%Y %H:%M:%S"))
df_scoresAgregado2 = ScoreExistente.write_df(df_sco)
print(f'Rows del df original: {df_sco.shape[0]}\nRows del df Agregado: {df_scoresAgregado2.shape[0]}\n')

filtered_df = df_sco[(df_sco['user_id'] == ScoreExistente.idUsuario) & (df_sco['movie_id'] == ScoreExistente.idPelicula)]
filtered_df_scoresAgregado = df_scoresAgregado2[(df_scoresAgregado2['user_id'] == ScoreExistente.idUsuario) & (df_scoresAgregado2['movie_id'] == ScoreExistente.idPelicula)]
print(f'Calificacion del Registro original:\n {filtered_df.head()}\n\nCalificacion del Registro updateado:\n{filtered_df_scoresAgregado.head()}\n')

Se actualizará la calificacion ya exstente para esa pelicula y de este usuario
Rows del df original: 100000
Rows del df Agregado: 100000

Calificacion del Registro original:
       user_id  movie_id  rating                Date
5047      250       200       5 1997-12-27 22:56:14

Calificacion del Registro updateado:
      user_id  movie_id  rating                 Date
5047      250       200       8  23/05/2024 15:29:32

In [34]:
#Vamos a Borrar del df original la pelicula con el score existente.
df_scoresEliminado = ScoreExistente.remove_from_df(df_sco)
print(f'Rows del df original: {df_sco.shape[0]}\nRows del df Agregado: {df_scoresEliminado.shape[0]}\n')

Rows del df original: 100000
Rows del df Agregado: 99999

In [35]:
a= Score.obtener_rating_promedio_variable(df_sco,'movie_id')
a

      movie_id    rating
0            1  3.878319
1            2  3.206107
2            3  3.033333
3            4  3.550239
4            5  3.302326
...        ...       ...
1677      1678  1.000000
1678      1679  3.000000
1679      1680  2.000000
1680      1681  3.000000
1681      1682  3.000000

[1682 rows x 2 columns]

In [61]:
Score.get_from_df(df_sco,anios=[1970,1999])

Date >= "1970-01-01" and Date <= "1999-12-31"

       user_id  movie_id  rating                Date
0          196       242       3 1997-12-04 15:55:49
1          186       302       3 1998-04-04 19:22:22
2           22       377       1 1997-11-07 07:18:36
3          244        51       2 1997-11-27 05:02:03
4          166       346       1 1998-02-02 05:33:16
...        ...       ...     ...                 ...
99995      880       476       3 1997-11-22 05:10:44
99996      716       204       5 1997-11-17 19:39:03
99997      276      1090       1 1997-09-20 22:49:55
99998       13       225       2 1997-12-17 22:52:36
99999       12       203       3 1997-11-19 17:13:03

[100000 rows x 4 columns]

In [62]:
from clases.Peliculas import Pelicula

df_peliculas = Pelicula.create_df_from_csv("../data/peliculas.csv")

In [80]:
df_sco['year'] = df_sco['Date'].dt.year
movies_agrupado=df_sco.groupby(['movie_id','year'])['rating'].mean().reset_index()
merged_df = pd.merge(movies_agrupado, df_peliculas, left_on='movie_id', right_on=id', how='inner')

In [81]:
merged_df

,id,Name,Release Date,IMDB URL,unknown,Action,Adventure,Animation,Childrens,Comedy,...,Mystery,Romance,SciFi,Thriller,War,Western,DateNorm,movie_id,year,rating
0,1,Toy Story (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,1,...,0,0,0,0,0,0,1995-01-01,1,1997,3.917603
1,1,Toy Story (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,1,...,0,0,0,0,0,0,1995-01-01,1,1998,3.821622
2,2,GoldenEye (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,0,...,0,0,0,1,0,0,1995-01-01,2,1997,3.314286
3,2,GoldenEye (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,0,...,0,0,0,1,0,0,1995-01-01,2,1998,3.081967
4,3,Four Rooms (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,0,...,0,0,0,1,0,0,1995-01-01,3,1997,2.894737
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
3106,1678,Mat' i syn (1997),06-Feb-1998,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...,0,0,0,0,0,0,...,0,0,0,0,0,0,1998-02-06,1678,1998,1.000000
3107,1679,B. Monkey (1998),06-Feb-1998,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...,0,0,0,0,0,0,...,0,1,0,1,0,0,1998-02-06,1679,1998,3.000000
3108,1680,Sliding Doors (1998),01-Jan-1998,http://us.imdb.com/Title?Sliding+Doors+(1998),0,0,0,0,0,0,...,0,1,0,0,0,0,1998-01-01,1680,1998,2.000000
3109,1681,You So Crazy (1994),01-Jan-1994,http://us.imdb.com/M/title-exact?You%20So%20Cr...,0,0,0,0,0,1,...,0,0,0,0,0,0,1994-01-01,1681,1998,3.000000
3110,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,http://us.imdb.com/M/title-exact?Schrei%20aus%...,0,0,0,0,0,0,...,0,0,0,0,0,0,1996-03-08,1682,1997,3.000000

In [ ]:
def joinear_scores_peliculas(df_mov,df_sco):

In [71]:
df_sco

       user_id  movie_id  rating                Date  year
0          196       242       3 1997-12-04 15:55:49  1997
1          186       302       3 1998-04-04 19:22:22  1998
2           22       377       1 1997-11-07 07:18:36  1997
3          244        51       2 1997-11-27 05:02:03  1997
4          166       346       1 1998-02-02 05:33:16  1998
...        ...       ...     ...                 ...   ...
99995      880       476       3 1997-11-22 05:10:44  1997
99996      716       204       5 1997-11-17 19:39:03  1997
99997      276      1090       1 1997-09-20 22:49:55  1997
99998       13       225       2 1997-12-17 22:52:36  1997
99999       12       203       3 1997-11-19 17:13:03  1997

[100000 rows x 5 columns]

In [72]:

agrupado

      movie_id  year    rating
0            1  1997  3.917603
1            1  1998  3.821622
2            2  1997  3.314286
3            2  1998  3.081967
4            3  1997  2.894737
...        ...   ...       ...
3106      1678  1998  1.000000
3107      1679  1998  3.000000
3108      1680  1998  2.000000
3109      1681  1998  3.000000
3110      1682  1997  3.000000

[3111 rows x 3 columns]

In [78]:
df_peliculas

,id,Name,Release Date,IMDB URL,unknown,Action,Adventure,Animation,Childrens,Comedy,...,FilmNoir,Horror,Musical,Mystery,Romance,SciFi,Thriller,War,Western,DateNorm
0,1,Toy Story (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,1,...,0,0,0,0,0,0,0,0,0,1995-01-01
1,2,GoldenEye (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,0,...,0,0,0,0,0,0,1,0,0,1995-01-01
2,3,Four Rooms (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Four%20Rooms%...,0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,1995-01-01
3,4,Get Shorty (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Get%20Shorty%...,0,1,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1995-01-01
4,5,Copycat (1995),01-Jan-1995,http://us.imdb.com/M/title-exact?Copycat%20(1995),0,0,0,0,0,0,...,0,0,0,0,0,0,1,0,0,1995-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1677,1678,Mat' i syn (1997),06-Feb-1998,http://us.imdb.com/M/title-exact?Mat%27+i+syn+...,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1998-02-06
1678,1679,B. Monkey (1998),06-Feb-1998,http://us.imdb.com/M/title-exact?B%2E+Monkey+(...,0,0,0,0,0,0,...,0,0,0,0,1,0,1,0,0,1998-02-06
1679,1680,Sliding Doors (1998),01-Jan-1998,http://us.imdb.com/Title?Sliding+Doors+(1998),0,0,0,0,0,0,...,0,0,0,0,1,0,0,0,0,1998-01-01
1680,1681,You So Crazy (1994),01-Jan-1994,http://us.imdb.com/M/title-exact?You%20So%20Cr...,0,0,0,0,0,1,...,0,0,0,0,0,0,0,0,0,1994-01-01
1681,1682,Scream of Stone (Schrei aus Stein) (1991),08-Mar-1996,http://us.imdb.com/M/title-exact?Schrei%20aus%...,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,1996-03-08

In [ ]:
df_peliculas[df_peliculas['Name'].str.contains('2000')]

In [ ]:

ListaPelisFiltradas2= Pelicula.filtrar_df(df_peliculas, generos = ['Comedy','Musical'], anios=[1900,2000])

ListaPelisFiltradas2

In [ ]:
df_peliculas

In [ ]:

#Pelicula.get_stats(df_peliculas, anios=[1960 , 1980])

In [ ]:
import matplotlib as plt

df_grafico=Pelicula.filtrar_df(df_peliculas, anios=[1960 , 1980])
# Extraer el año de la columna 'Release Date'
df_grafico=Pelicula.filtrar_df(df_peliculas, anios=[1960 , 1980], generos=['Comedy','Fantasy','Crime'])
df_grafico['year'] = df_grafico['DateNorm'].dt.year
df_grafico.drop('DateNorm', axis='columns', inplace=True)

# Filtrar solo las columnas de géneros y el año
genre_columns = df_grafico.columns[5:]  # Suponiendo que las primeras columnas no son géneros
df_genres = df_grafico[ list(genre_columns)]

In [ ]:
# Sumar la cantidad de películas por género en cada año
genre_by_year = df_genres.groupby('year').sum()

# Rellenar NaN con 0 (opcional, si hay algún año sin películas)
genre_by_year = genre_by_year.fillna(0)

In [ ]:
df_genres.head()

In [ ]:
genre_by_year.head()

In [ ]:
#genre_by_year = genre_by_year.set_index('year')

# Crear el gráfico de barras apiladas
genre_by_year.plot(kind='bar', stacked=True, figsize=(10, 7))

# Configurar las etiquetas y el título
plt.xlabel('Year')
plt.ylabel('Number of Movies')
plt.title('Number of Movies per Genre by Year')
plt.legend(title='Genre', bbox_to_anchor=(1.05, 1), loc='upper left')
plt.tight_layout()

# Mostrar el gráfico
plt.show()